#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrabChampions

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CrabChampions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class CrabChampions.CrabUI
// 0x0058 (0x02B8 - 0x0260)
class UCrabUI : public UUserWidget
{
public:
	uint8                                         Pad_13E6[0x58];                                    // 0x0260(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabUI">();
	}
	static class UCrabUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabUI>();
	}
};
static_assert(alignof(UCrabUI) == 0x000008, "Wrong alignment on UCrabUI");
static_assert(sizeof(UCrabUI) == 0x0002B8, "Wrong size on UCrabUI");

// Class CrabChampions.CrabChatEntryRowUI
// 0x0010 (0x02C8 - 0x02B8)
class UCrabChatEntryRowUI : public UCrabUI
{
public:
	class UTextBlock*                             PlayerNameText;                                    // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ChatMessageText;                                   // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabChatEntryRowUI">();
	}
	static class UCrabChatEntryRowUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabChatEntryRowUI>();
	}
};
static_assert(alignof(UCrabChatEntryRowUI) == 0x000008, "Wrong alignment on UCrabChatEntryRowUI");
static_assert(sizeof(UCrabChatEntryRowUI) == 0x0002C8, "Wrong size on UCrabChatEntryRowUI");
static_assert(offsetof(UCrabChatEntryRowUI, PlayerNameText) == 0x0002B8, "Member 'UCrabChatEntryRowUI::PlayerNameText' has a wrong offset!");
static_assert(offsetof(UCrabChatEntryRowUI, ChatMessageText) == 0x0002C0, "Member 'UCrabChatEntryRowUI::ChatMessageText' has a wrong offset!");

// Class CrabChampions.CrabActionDA
// 0x0038 (0x0068 - 0x0030)
class UCrabActionDA : public UDataAsset
{
public:
	float                                         Range;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequiresLOS;                                      // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustBeGrounded;                                   // 0x0035(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13E7[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Weight;                                            // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopMovementDuringAction;                         // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13E8[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopingActionInterval;                             // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13E9[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage;                                           // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FXSocketName;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         FX;                                                // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                              Sound;                                             // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabActionDA">();
	}
	static class UCrabActionDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabActionDA>();
	}
};
static_assert(alignof(UCrabActionDA) == 0x000008, "Wrong alignment on UCrabActionDA");
static_assert(sizeof(UCrabActionDA) == 0x000068, "Wrong size on UCrabActionDA");
static_assert(offsetof(UCrabActionDA, Range) == 0x000030, "Member 'UCrabActionDA::Range' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, bRequiresLOS) == 0x000034, "Member 'UCrabActionDA::bRequiresLOS' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, bMustBeGrounded) == 0x000035, "Member 'UCrabActionDA::bMustBeGrounded' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, Weight) == 0x000038, "Member 'UCrabActionDA::Weight' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, bStopMovementDuringAction) == 0x00003C, "Member 'UCrabActionDA::bStopMovementDuringAction' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, LoopingActionInterval) == 0x000040, "Member 'UCrabActionDA::LoopingActionInterval' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, Montage) == 0x000048, "Member 'UCrabActionDA::Montage' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, FXSocketName) == 0x000050, "Member 'UCrabActionDA::FXSocketName' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, FX) == 0x000058, "Member 'UCrabActionDA::FX' has a wrong offset!");
static_assert(offsetof(UCrabActionDA, Sound) == 0x000060, "Member 'UCrabActionDA::Sound' has a wrong offset!");

// Class CrabChampions.CrabTurret
// 0x0118 (0x0338 - 0x0220)
class ACrabTurret : public AActor
{
public:
	uint8                                         Pad_13EA[0x8];                                     // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x0228(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   TurretMesh;                                        // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      TurretNC;                                          // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCrabHC*                                HC;                                                // 0x0240(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                       HealthBarWC;                                       // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MuzzleSocketName;                                  // 0x0250(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      MuzzleFlashNC;                                     // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        GunshotAC;                                         // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           Tint;                                              // 0x0268(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            BaseMeshToSpawn;                                   // 0x0278(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            TurretMeshToSpawn;                                 // 0x0280(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         FX;                                                // 0x0288(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACrabC*                                 OwningC;                                           // 0x0290(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SearchFrequency;                                   // 0x0298(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FireRate;                                          // 0x029C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13EB[0x8];                                     // 0x02A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCrabHealthBarUI>           HealthBarUIToSpawn;                                // 0x02A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HealthBarHeightOffset;                             // 0x02B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13EC[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TurretName;                                        // 0x02B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         MuzzleFlashFX;                                     // 0x02C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundCue*                              GunshotSound;                                      // 0x02D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TurretRotationSpeed;                               // 0x02D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13ED[0xC];                                     // 0x02DC(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class ACrabC*                                 BestEnemyC;                                        // 0x02E8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SearchRange;                                       // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13EE[0x14];                                    // 0x02F4(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrabProjectileDA*                      ProjectileDA;                                      // 0x0308(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCrabDebuff                            Debuff;                                            // 0x0310(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsExploded;                                       // 0x0318(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13EF[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         ExplosionFX;                                       // 0x0320(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundCue*                              ExplosionSound;                                    // 0x0328(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCameraShakeBase>           ExplosionCameraShake;                              // 0x0330(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_IsExploded();
	void OnRep_OwningC();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabTurret">();
	}
	static class ACrabTurret* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrabTurret>();
	}
};
static_assert(alignof(ACrabTurret) == 0x000008, "Wrong alignment on ACrabTurret");
static_assert(sizeof(ACrabTurret) == 0x000338, "Wrong size on ACrabTurret");
static_assert(offsetof(ACrabTurret, BaseMesh) == 0x000228, "Member 'ACrabTurret::BaseMesh' has a wrong offset!");
static_assert(offsetof(ACrabTurret, TurretMesh) == 0x000230, "Member 'ACrabTurret::TurretMesh' has a wrong offset!");
static_assert(offsetof(ACrabTurret, TurretNC) == 0x000238, "Member 'ACrabTurret::TurretNC' has a wrong offset!");
static_assert(offsetof(ACrabTurret, HC) == 0x000240, "Member 'ACrabTurret::HC' has a wrong offset!");
static_assert(offsetof(ACrabTurret, HealthBarWC) == 0x000248, "Member 'ACrabTurret::HealthBarWC' has a wrong offset!");
static_assert(offsetof(ACrabTurret, MuzzleSocketName) == 0x000250, "Member 'ACrabTurret::MuzzleSocketName' has a wrong offset!");
static_assert(offsetof(ACrabTurret, MuzzleFlashNC) == 0x000258, "Member 'ACrabTurret::MuzzleFlashNC' has a wrong offset!");
static_assert(offsetof(ACrabTurret, GunshotAC) == 0x000260, "Member 'ACrabTurret::GunshotAC' has a wrong offset!");
static_assert(offsetof(ACrabTurret, Tint) == 0x000268, "Member 'ACrabTurret::Tint' has a wrong offset!");
static_assert(offsetof(ACrabTurret, BaseMeshToSpawn) == 0x000278, "Member 'ACrabTurret::BaseMeshToSpawn' has a wrong offset!");
static_assert(offsetof(ACrabTurret, TurretMeshToSpawn) == 0x000280, "Member 'ACrabTurret::TurretMeshToSpawn' has a wrong offset!");
static_assert(offsetof(ACrabTurret, FX) == 0x000288, "Member 'ACrabTurret::FX' has a wrong offset!");
static_assert(offsetof(ACrabTurret, OwningC) == 0x000290, "Member 'ACrabTurret::OwningC' has a wrong offset!");
static_assert(offsetof(ACrabTurret, SearchFrequency) == 0x000298, "Member 'ACrabTurret::SearchFrequency' has a wrong offset!");
static_assert(offsetof(ACrabTurret, FireRate) == 0x00029C, "Member 'ACrabTurret::FireRate' has a wrong offset!");
static_assert(offsetof(ACrabTurret, HealthBarUIToSpawn) == 0x0002A8, "Member 'ACrabTurret::HealthBarUIToSpawn' has a wrong offset!");
static_assert(offsetof(ACrabTurret, HealthBarHeightOffset) == 0x0002B0, "Member 'ACrabTurret::HealthBarHeightOffset' has a wrong offset!");
static_assert(offsetof(ACrabTurret, TurretName) == 0x0002B8, "Member 'ACrabTurret::TurretName' has a wrong offset!");
static_assert(offsetof(ACrabTurret, MuzzleFlashFX) == 0x0002C8, "Member 'ACrabTurret::MuzzleFlashFX' has a wrong offset!");
static_assert(offsetof(ACrabTurret, GunshotSound) == 0x0002D0, "Member 'ACrabTurret::GunshotSound' has a wrong offset!");
static_assert(offsetof(ACrabTurret, TurretRotationSpeed) == 0x0002D8, "Member 'ACrabTurret::TurretRotationSpeed' has a wrong offset!");
static_assert(offsetof(ACrabTurret, BestEnemyC) == 0x0002E8, "Member 'ACrabTurret::BestEnemyC' has a wrong offset!");
static_assert(offsetof(ACrabTurret, SearchRange) == 0x0002F0, "Member 'ACrabTurret::SearchRange' has a wrong offset!");
static_assert(offsetof(ACrabTurret, ProjectileDA) == 0x000308, "Member 'ACrabTurret::ProjectileDA' has a wrong offset!");
static_assert(offsetof(ACrabTurret, Debuff) == 0x000310, "Member 'ACrabTurret::Debuff' has a wrong offset!");
static_assert(offsetof(ACrabTurret, bIsExploded) == 0x000318, "Member 'ACrabTurret::bIsExploded' has a wrong offset!");
static_assert(offsetof(ACrabTurret, ExplosionFX) == 0x000320, "Member 'ACrabTurret::ExplosionFX' has a wrong offset!");
static_assert(offsetof(ACrabTurret, ExplosionSound) == 0x000328, "Member 'ACrabTurret::ExplosionSound' has a wrong offset!");
static_assert(offsetof(ACrabTurret, ExplosionCameraShake) == 0x000330, "Member 'ACrabTurret::ExplosionCameraShake' has a wrong offset!");

// Class CrabChampions.CrabAOEActionDA
// 0x0008 (0x0070 - 0x0068)
class UCrabAOEActionDA final : public UCrabActionDA
{
public:
	class UCrabAOEDA*                             AOEDA;                                             // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabAOEActionDA">();
	}
	static class UCrabAOEActionDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabAOEActionDA>();
	}
};
static_assert(alignof(UCrabAOEActionDA) == 0x000008, "Wrong alignment on UCrabAOEActionDA");
static_assert(sizeof(UCrabAOEActionDA) == 0x000070, "Wrong size on UCrabAOEActionDA");
static_assert(offsetof(UCrabAOEActionDA, AOEDA) == 0x000068, "Member 'UCrabAOEActionDA::AOEDA' has a wrong offset!");

// Class CrabChampions.CrabCosmeticSlotUI
// 0x0078 (0x0330 - 0x02B8)
class UCrabCosmeticSlotUI : public UCrabUI
{
public:
	struct FCrabChallenge                         ChallengeToUnlock;                                 // 0x02B8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class UCrabCosmeticsMenuUI*                   OwningCosmeticsMenuUI;                             // 0x0308(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                SlotButton;                                        // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 SlotIconImage;                                     // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               SlotLockedOverlay;                                 // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                SlotSelectedBorder;                                // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnHoveredSlotButton();
	void OnPressedSlotButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabCosmeticSlotUI">();
	}
	static class UCrabCosmeticSlotUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabCosmeticSlotUI>();
	}
};
static_assert(alignof(UCrabCosmeticSlotUI) == 0x000008, "Wrong alignment on UCrabCosmeticSlotUI");
static_assert(sizeof(UCrabCosmeticSlotUI) == 0x000330, "Wrong size on UCrabCosmeticSlotUI");
static_assert(offsetof(UCrabCosmeticSlotUI, ChallengeToUnlock) == 0x0002B8, "Member 'UCrabCosmeticSlotUI::ChallengeToUnlock' has a wrong offset!");
static_assert(offsetof(UCrabCosmeticSlotUI, OwningCosmeticsMenuUI) == 0x000308, "Member 'UCrabCosmeticSlotUI::OwningCosmeticsMenuUI' has a wrong offset!");
static_assert(offsetof(UCrabCosmeticSlotUI, SlotButton) == 0x000310, "Member 'UCrabCosmeticSlotUI::SlotButton' has a wrong offset!");
static_assert(offsetof(UCrabCosmeticSlotUI, SlotIconImage) == 0x000318, "Member 'UCrabCosmeticSlotUI::SlotIconImage' has a wrong offset!");
static_assert(offsetof(UCrabCosmeticSlotUI, SlotLockedOverlay) == 0x000320, "Member 'UCrabCosmeticSlotUI::SlotLockedOverlay' has a wrong offset!");
static_assert(offsetof(UCrabCosmeticSlotUI, SlotSelectedBorder) == 0x000328, "Member 'UCrabCosmeticSlotUI::SlotSelectedBorder' has a wrong offset!");

// Class CrabChampions.CrabLaunchActionDA
// 0x0010 (0x0078 - 0x0068)
class UCrabLaunchActionDA final : public UCrabActionDA
{
public:
	float                                         PreLaunchHeight;                                   // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaunchSpeed;                                       // 0x006C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCrabAOEDA*                             LandAOEDA;                                         // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabLaunchActionDA">();
	}
	static class UCrabLaunchActionDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabLaunchActionDA>();
	}
};
static_assert(alignof(UCrabLaunchActionDA) == 0x000008, "Wrong alignment on UCrabLaunchActionDA");
static_assert(sizeof(UCrabLaunchActionDA) == 0x000078, "Wrong size on UCrabLaunchActionDA");
static_assert(offsetof(UCrabLaunchActionDA, PreLaunchHeight) == 0x000068, "Member 'UCrabLaunchActionDA::PreLaunchHeight' has a wrong offset!");
static_assert(offsetof(UCrabLaunchActionDA, LaunchSpeed) == 0x00006C, "Member 'UCrabLaunchActionDA::LaunchSpeed' has a wrong offset!");
static_assert(offsetof(UCrabLaunchActionDA, LandAOEDA) == 0x000070, "Member 'UCrabLaunchActionDA::LandAOEDA' has a wrong offset!");

// Class CrabChampions.CrabControlsMenuUI
// 0x0060 (0x0318 - 0x02B8)
class UCrabControlsMenuUI : public UCrabUI
{
public:
	TArray<class UWidget*>                        ControlsMenuFocusableWidgetArray;                  // 0x02B8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UCrabSliderUI*                          LookSensitivitySlider;                             // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCrabSliderUI*                          AimingSensitivityMultiplierSlider;                 // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCrabArrowSelectionUI*                  VerticalLookInversionAS;                           // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCrabArrowSelectionUI*                  AimAssistStrengthAS;                               // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCrabKeyBindRowUI>          KeyBindRowUIToSpawn;                               // 0x02E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           ControlsVerticalBox;                               // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCrabKeyBind>                   CurrentKeyBinds;                                   // 0x02F8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UCrabKeyBindRowUI*>              KeyBindRows;                                       // 0x0308(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabControlsMenuUI">();
	}
	static class UCrabControlsMenuUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabControlsMenuUI>();
	}
};
static_assert(alignof(UCrabControlsMenuUI) == 0x000008, "Wrong alignment on UCrabControlsMenuUI");
static_assert(sizeof(UCrabControlsMenuUI) == 0x000318, "Wrong size on UCrabControlsMenuUI");
static_assert(offsetof(UCrabControlsMenuUI, ControlsMenuFocusableWidgetArray) == 0x0002B8, "Member 'UCrabControlsMenuUI::ControlsMenuFocusableWidgetArray' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, LookSensitivitySlider) == 0x0002C8, "Member 'UCrabControlsMenuUI::LookSensitivitySlider' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, AimingSensitivityMultiplierSlider) == 0x0002D0, "Member 'UCrabControlsMenuUI::AimingSensitivityMultiplierSlider' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, VerticalLookInversionAS) == 0x0002D8, "Member 'UCrabControlsMenuUI::VerticalLookInversionAS' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, AimAssistStrengthAS) == 0x0002E0, "Member 'UCrabControlsMenuUI::AimAssistStrengthAS' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, KeyBindRowUIToSpawn) == 0x0002E8, "Member 'UCrabControlsMenuUI::KeyBindRowUIToSpawn' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, ControlsVerticalBox) == 0x0002F0, "Member 'UCrabControlsMenuUI::ControlsVerticalBox' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, CurrentKeyBinds) == 0x0002F8, "Member 'UCrabControlsMenuUI::CurrentKeyBinds' has a wrong offset!");
static_assert(offsetof(UCrabControlsMenuUI, KeyBindRows) == 0x000308, "Member 'UCrabControlsMenuUI::KeyBindRows' has a wrong offset!");

// Class CrabChampions.CrabSpawnActionDA
// 0x0018 (0x0080 - 0x0068)
class UCrabSpawnActionDA final : public UCrabActionDA
{
public:
	TArray<TSubclassOf<class ACrabEnemyC>>        LesserEnemiesToSpawn;                              // 0x0068(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         MaxSpawnedLesserEnemies;                           // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13F0[0x4];                                     // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabSpawnActionDA">();
	}
	static class UCrabSpawnActionDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabSpawnActionDA>();
	}
};
static_assert(alignof(UCrabSpawnActionDA) == 0x000008, "Wrong alignment on UCrabSpawnActionDA");
static_assert(sizeof(UCrabSpawnActionDA) == 0x000080, "Wrong size on UCrabSpawnActionDA");
static_assert(offsetof(UCrabSpawnActionDA, LesserEnemiesToSpawn) == 0x000068, "Member 'UCrabSpawnActionDA::LesserEnemiesToSpawn' has a wrong offset!");
static_assert(offsetof(UCrabSpawnActionDA, MaxSpawnedLesserEnemies) == 0x000078, "Member 'UCrabSpawnActionDA::MaxSpawnedLesserEnemies' has a wrong offset!");

// Class CrabChampions.CrabCrosshairUI
// 0x0058 (0x0310 - 0x02B8)
class UCrabCrosshairUI : public UCrabUI
{
public:
	class ACrabPlayerC*                           OwningC;                                           // 0x02B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACrabWeapon*                            EquippedWeapon;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 CrosshairImage;                                    // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               CrosshairMI;                                       // 0x02D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13F1[0x10];                                    // 0x02D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       FireAnim;                                          // 0x02E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 HitmarkerImage;                                    // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       GenericHitmarkerAnim;                              // 0x02F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       ArmorBreakHitmarkerAnim;                           // 0x0300(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       EliminationHitmarkerAnim;                          // 0x0308(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabCrosshairUI">();
	}
	static class UCrabCrosshairUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabCrosshairUI>();
	}
};
static_assert(alignof(UCrabCrosshairUI) == 0x000008, "Wrong alignment on UCrabCrosshairUI");
static_assert(sizeof(UCrabCrosshairUI) == 0x000310, "Wrong size on UCrabCrosshairUI");
static_assert(offsetof(UCrabCrosshairUI, OwningC) == 0x0002B8, "Member 'UCrabCrosshairUI::OwningC' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, EquippedWeapon) == 0x0002C0, "Member 'UCrabCrosshairUI::EquippedWeapon' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, CrosshairImage) == 0x0002C8, "Member 'UCrabCrosshairUI::CrosshairImage' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, CrosshairMI) == 0x0002D0, "Member 'UCrabCrosshairUI::CrosshairMI' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, FireAnim) == 0x0002E8, "Member 'UCrabCrosshairUI::FireAnim' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, HitmarkerImage) == 0x0002F0, "Member 'UCrabCrosshairUI::HitmarkerImage' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, GenericHitmarkerAnim) == 0x0002F8, "Member 'UCrabCrosshairUI::GenericHitmarkerAnim' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, ArmorBreakHitmarkerAnim) == 0x000300, "Member 'UCrabCrosshairUI::ArmorBreakHitmarkerAnim' has a wrong offset!");
static_assert(offsetof(UCrabCrosshairUI, EliminationHitmarkerAnim) == 0x000308, "Member 'UCrabCrosshairUI::EliminationHitmarkerAnim' has a wrong offset!");

// Class CrabChampions.CrabProximityExplodeActionDA
// 0x0008 (0x0070 - 0x0068)
class UCrabProximityExplodeActionDA final : public UCrabActionDA
{
public:
	class UCrabAOEDA*                             ExplosionAOEDA;                                    // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabProximityExplodeActionDA">();
	}
	static class UCrabProximityExplodeActionDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabProximityExplodeActionDA>();
	}
};
static_assert(alignof(UCrabProximityExplodeActionDA) == 0x000008, "Wrong alignment on UCrabProximityExplodeActionDA");
static_assert(sizeof(UCrabProximityExplodeActionDA) == 0x000070, "Wrong size on UCrabProximityExplodeActionDA");
static_assert(offsetof(UCrabProximityExplodeActionDA, ExplosionAOEDA) == 0x000068, "Member 'UCrabProximityExplodeActionDA::ExplosionAOEDA' has a wrong offset!");

// Class CrabChampions.CrabDifficultyModifierUI
// 0x0040 (0x02F8 - 0x02B8)
class UCrabDifficultyModifierUI : public UCrabUI
{
public:
	class UCrabDifficultyMenuUI*                  OwningDifficultyMenuUI;                            // 0x02B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13F2[0x8];                                     // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               DifficultyModifierOverlay;                         // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                DifficultyModifierButton;                          // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             DifficultyModifierNameText;                        // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             DifficultyModifierDescriptionText;                 // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               ChallengeLevelOverlay;                             // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ChallengeLevelText;                                // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnHoveredDifficultyModifierButton();
	void OnPressedDifficultyModifierButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabDifficultyModifierUI">();
	}
	static class UCrabDifficultyModifierUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabDifficultyModifierUI>();
	}
};
static_assert(alignof(UCrabDifficultyModifierUI) == 0x000008, "Wrong alignment on UCrabDifficultyModifierUI");
static_assert(sizeof(UCrabDifficultyModifierUI) == 0x0002F8, "Wrong size on UCrabDifficultyModifierUI");
static_assert(offsetof(UCrabDifficultyModifierUI, OwningDifficultyMenuUI) == 0x0002B8, "Member 'UCrabDifficultyModifierUI::OwningDifficultyMenuUI' has a wrong offset!");
static_assert(offsetof(UCrabDifficultyModifierUI, DifficultyModifierOverlay) == 0x0002C8, "Member 'UCrabDifficultyModifierUI::DifficultyModifierOverlay' has a wrong offset!");
static_assert(offsetof(UCrabDifficultyModifierUI, DifficultyModifierButton) == 0x0002D0, "Member 'UCrabDifficultyModifierUI::DifficultyModifierButton' has a wrong offset!");
static_assert(offsetof(UCrabDifficultyModifierUI, DifficultyModifierNameText) == 0x0002D8, "Member 'UCrabDifficultyModifierUI::DifficultyModifierNameText' has a wrong offset!");
static_assert(offsetof(UCrabDifficultyModifierUI, DifficultyModifierDescriptionText) == 0x0002E0, "Member 'UCrabDifficultyModifierUI::DifficultyModifierDescriptionText' has a wrong offset!");
static_assert(offsetof(UCrabDifficultyModifierUI, ChallengeLevelOverlay) == 0x0002E8, "Member 'UCrabDifficultyModifierUI::ChallengeLevelOverlay' has a wrong offset!");
static_assert(offsetof(UCrabDifficultyModifierUI, ChallengeLevelText) == 0x0002F0, "Member 'UCrabDifficultyModifierUI::ChallengeLevelText' has a wrong offset!");

// Class CrabChampions.CrabStrikeActionDA
// 0x0028 (0x0090 - 0x0068)
class UCrabStrikeActionDA final : public UCrabActionDA
{
public:
	ECrabTargetType                               TargetType;                                        // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13F3[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ACrabStrike>                StrikeToSpawn;                                     // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLineStrikesToSpawn;                             // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineStrikeSpawnFrequency;                          // 0x007C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECrabFormationType                            FormationType;                                     // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13F4[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FormationSpacing;                                  // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spread;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13F5[0x4];                                     // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabStrikeActionDA">();
	}
	static class UCrabStrikeActionDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabStrikeActionDA>();
	}
};
static_assert(alignof(UCrabStrikeActionDA) == 0x000008, "Wrong alignment on UCrabStrikeActionDA");
static_assert(sizeof(UCrabStrikeActionDA) == 0x000090, "Wrong size on UCrabStrikeActionDA");
static_assert(offsetof(UCrabStrikeActionDA, TargetType) == 0x000068, "Member 'UCrabStrikeActionDA::TargetType' has a wrong offset!");
static_assert(offsetof(UCrabStrikeActionDA, StrikeToSpawn) == 0x000070, "Member 'UCrabStrikeActionDA::StrikeToSpawn' has a wrong offset!");
static_assert(offsetof(UCrabStrikeActionDA, NumLineStrikesToSpawn) == 0x000078, "Member 'UCrabStrikeActionDA::NumLineStrikesToSpawn' has a wrong offset!");
static_assert(offsetof(UCrabStrikeActionDA, LineStrikeSpawnFrequency) == 0x00007C, "Member 'UCrabStrikeActionDA::LineStrikeSpawnFrequency' has a wrong offset!");
static_assert(offsetof(UCrabStrikeActionDA, FormationType) == 0x000080, "Member 'UCrabStrikeActionDA::FormationType' has a wrong offset!");
static_assert(offsetof(UCrabStrikeActionDA, FormationSpacing) == 0x000084, "Member 'UCrabStrikeActionDA::FormationSpacing' has a wrong offset!");
static_assert(offsetof(UCrabStrikeActionDA, Spread) == 0x000088, "Member 'UCrabStrikeActionDA::Spread' has a wrong offset!");

// Class CrabChampions.CrabFocusMenuUI
// 0x0118 (0x03D0 - 0x02B8)
class UCrabFocusMenuUI : public UCrabUI
{
public:
	class UWidgetSwitcher*                        MenuWidgetSwitcher;                                // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWidget*>                        FocusableWidgetArray;                              // 0x02C0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class ACrabPC*                                OwningPC;                                          // 0x02D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13F6[0x70];                                    // 0x02D8(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                PreviouslyFocusedWidget;                           // 0x0348(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           MenuCanvasPanel;                                   // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ResetFocusButton;                                  // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundCue*                              HoverSound;                                        // 0x0360(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundCue*                              PressSound;                                        // 0x0368(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             MenuActionKeyText;                                 // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 MenuActionControllerIcon;                          // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             MenuBackKeyText;                                   // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 MenuBackControllerIcon;                            // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             NextSubmenuKeyText;                                // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 NextSubmenuIcon;                                   // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PreviousSubmenuKeyText;                            // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 PreviousSubmenuIcon;                               // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         SubmenuHorizontalBox;                              // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13F7[0x8];                                     // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                ActionButton;                                      // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                BackButton;                                        // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPressedActionButton();
	void OnPressedBackButton();
	void OnPressedResetFocusButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabFocusMenuUI">();
	}
	static class UCrabFocusMenuUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabFocusMenuUI>();
	}
};
static_assert(alignof(UCrabFocusMenuUI) == 0x000008, "Wrong alignment on UCrabFocusMenuUI");
static_assert(sizeof(UCrabFocusMenuUI) == 0x0003D0, "Wrong size on UCrabFocusMenuUI");
static_assert(offsetof(UCrabFocusMenuUI, MenuWidgetSwitcher) == 0x0002B8, "Member 'UCrabFocusMenuUI::MenuWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, FocusableWidgetArray) == 0x0002C0, "Member 'UCrabFocusMenuUI::FocusableWidgetArray' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, OwningPC) == 0x0002D0, "Member 'UCrabFocusMenuUI::OwningPC' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, PreviouslyFocusedWidget) == 0x000348, "Member 'UCrabFocusMenuUI::PreviouslyFocusedWidget' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, MenuCanvasPanel) == 0x000350, "Member 'UCrabFocusMenuUI::MenuCanvasPanel' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, ResetFocusButton) == 0x000358, "Member 'UCrabFocusMenuUI::ResetFocusButton' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, HoverSound) == 0x000360, "Member 'UCrabFocusMenuUI::HoverSound' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, PressSound) == 0x000368, "Member 'UCrabFocusMenuUI::PressSound' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, MenuActionKeyText) == 0x000370, "Member 'UCrabFocusMenuUI::MenuActionKeyText' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, MenuActionControllerIcon) == 0x000378, "Member 'UCrabFocusMenuUI::MenuActionControllerIcon' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, MenuBackKeyText) == 0x000380, "Member 'UCrabFocusMenuUI::MenuBackKeyText' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, MenuBackControllerIcon) == 0x000388, "Member 'UCrabFocusMenuUI::MenuBackControllerIcon' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, NextSubmenuKeyText) == 0x000390, "Member 'UCrabFocusMenuUI::NextSubmenuKeyText' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, NextSubmenuIcon) == 0x000398, "Member 'UCrabFocusMenuUI::NextSubmenuIcon' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, PreviousSubmenuKeyText) == 0x0003A0, "Member 'UCrabFocusMenuUI::PreviousSubmenuKeyText' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, PreviousSubmenuIcon) == 0x0003A8, "Member 'UCrabFocusMenuUI::PreviousSubmenuIcon' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, SubmenuHorizontalBox) == 0x0003B0, "Member 'UCrabFocusMenuUI::SubmenuHorizontalBox' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, ActionButton) == 0x0003C0, "Member 'UCrabFocusMenuUI::ActionButton' has a wrong offset!");
static_assert(offsetof(UCrabFocusMenuUI, BackButton) == 0x0003C8, "Member 'UCrabFocusMenuUI::BackButton' has a wrong offset!");

// Class CrabChampions.CrabAnimInstance
// 0x0010 (0x02D0 - 0x02C0)
class UCrabAnimInstance : public UAnimInstance
{
public:
	class ACrabC*                                 OwningC;                                           // 0x02B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Pitch;                                             // 0x02C0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Direction;                                         // 0x02C4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Speed;                                             // 0x02C8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsFalling;                                        // 0x02CC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsKnockedBack;                                    // 0x02CD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13F8[0x2];                                     // 0x02CE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabAnimInstance">();
	}
	static class UCrabAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabAnimInstance>();
	}
};
static_assert(alignof(UCrabAnimInstance) == 0x000010, "Wrong alignment on UCrabAnimInstance");
static_assert(sizeof(UCrabAnimInstance) == 0x0002D0, "Wrong size on UCrabAnimInstance");
static_assert(offsetof(UCrabAnimInstance, OwningC) == 0x0002B8, "Member 'UCrabAnimInstance::OwningC' has a wrong offset!");
static_assert(offsetof(UCrabAnimInstance, Pitch) == 0x0002C0, "Member 'UCrabAnimInstance::Pitch' has a wrong offset!");
static_assert(offsetof(UCrabAnimInstance, Direction) == 0x0002C4, "Member 'UCrabAnimInstance::Direction' has a wrong offset!");
static_assert(offsetof(UCrabAnimInstance, Speed) == 0x0002C8, "Member 'UCrabAnimInstance::Speed' has a wrong offset!");
static_assert(offsetof(UCrabAnimInstance, bIsFalling) == 0x0002CC, "Member 'UCrabAnimInstance::bIsFalling' has a wrong offset!");
static_assert(offsetof(UCrabAnimInstance, bIsKnockedBack) == 0x0002CD, "Member 'UCrabAnimInstance::bIsKnockedBack' has a wrong offset!");

// Class CrabChampions.CrabConfirmationPromptUI
// 0x0030 (0x0400 - 0x03D0)
class UCrabConfirmationPromptUI : public UCrabFocusMenuUI
{
public:
	class UTextBlock*                             ConfirmationPromptMessageText;                     // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                YesButton;                                         // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                NoButton;                                          // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13F9[0x18];                                    // 0x03E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHoveredNoButton();
	void OnHoveredYesButton();
	void OnPressedNoButton();
	void OnPressedYesButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabConfirmationPromptUI">();
	}
	static class UCrabConfirmationPromptUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabConfirmationPromptUI>();
	}
};
static_assert(alignof(UCrabConfirmationPromptUI) == 0x000008, "Wrong alignment on UCrabConfirmationPromptUI");
static_assert(sizeof(UCrabConfirmationPromptUI) == 0x000400, "Wrong size on UCrabConfirmationPromptUI");
static_assert(offsetof(UCrabConfirmationPromptUI, ConfirmationPromptMessageText) == 0x0003D0, "Member 'UCrabConfirmationPromptUI::ConfirmationPromptMessageText' has a wrong offset!");
static_assert(offsetof(UCrabConfirmationPromptUI, YesButton) == 0x0003D8, "Member 'UCrabConfirmationPromptUI::YesButton' has a wrong offset!");
static_assert(offsetof(UCrabConfirmationPromptUI, NoButton) == 0x0003E0, "Member 'UCrabConfirmationPromptUI::NoButton' has a wrong offset!");

// Class CrabChampions.CrabAOEDA
// 0x0038 (0x0068 - 0x0030)
class UCrabAOEDA final : public UDataAsset
{
public:
	class FName                                   SocketName;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECrabDamageType                               DamageType;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13FA[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         KnockbackStrength;                                 // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ACrabDamageArea>            DamageAreaToSpawn;                                 // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         AOEFX;                                             // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                              AOESound;                                          // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraShakeBase>           CameraShake;                                       // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrabAOEDA">();
	}
	static class UCrabAOEDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrabAOEDA>();
	}
};
static_assert(alignof(UCrabAOEDA) == 0x000008, "Wrong alignment on UCrabAOEDA");
static_assert(sizeof(UCrabAOEDA) == 0x000068, "Wrong size on UCrabAOEDA");
static_assert(offsetof(UCrabAOEDA, SocketName) == 0x000030, "Member 'UCrabAOEDA::SocketName' has a wrong offset!");
static_assert(offsetof(UCrabAOEDA, Radius) == 0x000038, "Member 'UCrabAOEDA::Radius' has a wrong offset!");
